attacker/data/ac+scaling+filtering/spoofing/ab_results/ab_21.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   32.612 seconds
Complete requests:      20
Failed requests:        0
Keep-Alive requests:    20
Total transferred:      4880 bytes
HTML transferred:       1900 bytes
Requests per second:    0.61 [#/sec] (mean)
Time per request:       16306.004 [ms] (mean)
Time per request:       1630.600 [ms] (mean, across all concurrent requests)
Transfer rate:          0.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   4.0      4      18
Processing:    57 1752 7175.7    175   32238
Waiting:       56 1752 7175.5    175   32236
Total:         57 1755 7179.2    178   32255

Percentage of the requests served within a certain time (ms)
  50%    178
  66%    187
  75%    200
  80%    200
  90%    225
  95%  32255
  98%  32255
  99%  32255
 100%  32255 (longest request)
